Diject/Ledokall/LCube/LCube.ioc
ProjectManager.HeapSize=0x10000
ProjectManager.KeepUserCode=true
ProjectManager.LastFirmware=true
ProjectManager.LibraryCopy=1
ProjectManager.MainLocation=Src
ProjectManager.NoMain=false
ProjectManager.PreviousToolchain=STM32CubeIDE
ProjectManager.ProjectBuild=false
ProjectManager.ProjectFileName=LCube.ioc
ProjectManager.ProjectName=LCube
ProjectManager.RegisterCallBack=
ProjectManager.StackSize=0x4000
ProjectManager.TargetToolchain=STM32CubeIDE
ProjectManager.ToolChainLocation=
ProjectManager.UnderRoot=true
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_I2C3_Init-I2C3-false-HAL-true,6-MX_I2S1_Init-I2S1-false-HAL-true,7-MX_RTC_Init-RTC-false-HAL-true,8-MX_TIM1_Init-TIM1-false-HAL-true,9-MX_SDIO_SD_Init-SDIO-true-HAL-false,10-MX_FATFS_Init-FATFS-true-HAL-false,11-MX_TIM5_Init-TIM5-true-HAL-false,12-MX_TIM3_Init-TIM3-false-HAL-true,13-MX_CRC_Init-CRC-false-HAL-true,14-MX_TIM4_Init-TIM4-true-HAL-true,15-MX_TIM10_Init-TIM10-false-HAL-true,16-MX_TIM11_Init-TIM11-false-HAL-true,17-MX_TIM12_Init-TIM12-false-HAL-true,18-MX_USB_OTG_FS_PCD_Init-USB_OTG_FS-true-HAL-true
RCC.AHBFreq_Value=120000000
RCC.APB1CLKDivider=RCC_HCLK_DIV2
RCC.APB1Freq_Value=60000000
RCC.APB1TimFreq_Value=120000000
RCC.APB2CLKDivider=RCC_HCLK_DIV2
RCC.APB2Freq_Value=60000000
RCC.APB2TimFreq_Value=120000000
RCC.CortexFreq_Value=120000000
RCC.DFSDMAudioFreq_Value=49402597.402597405
RCC.DFSDMFreq_Value=60000000
RCC.FCLKCortexFreq_Value=120000000
RCC.FLatency=FLASH_LATENCY_4
RCC.FMPI2C1Freq_Value=60000000
RCC.FamilyName=M
RCC.HCLKFreq_Value=120000000
RCC.HSE_VALUE=12000000
RCC.I2S1Freq_Value=49402597.402597405
RCC.I2S2Freq_Value=49402597.402597405
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CortexFreq_Value,DFSDMAudioFreq_Value,DFSDMFreq_Value,FCLKCortexFreq_Value,FLatency,FMPI2C1Freq_Value,FamilyName,HCLKFreq_Value,HSE_VALUE,I2S1Freq_Value,I2S2Freq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SM,PLLI2SN,PLLI2SP,PLLI2SPCLKFreq_Value,PLLI2SQ,PLLI2SQCLKFreq_Value,PLLI2SQoutputFreq_Value,PLLI2SR,PLLI2SRCLKFreq_Value,PLLI2SoutputFreq_Value,PLLM,PLLN,PLLQ,PLLQCLKFreq_Value,PLLQoutputFreq_Value,PLLR,PLLRCLKFreq_Value,PLLRoutputFreq_Value,PWRFreq_Value,RCC_RTC_Clock_Source,RCC_RTC_Clock_SourceVirtual,RCC_TIM_PRescaler_Selection,RNGFreq_Value,RTCFreq_Value,SDIOFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
RCC.MCO2PinFreq_Value=120000000
RCC.PLLCLKFreq_Value=120000000
RCC.PLLI2SM=11
RCC.PLLI2SN=317
RCC.PLLI2SP=RCC_PLLI2SP_DIV8
RCC.PLLI2SPCLKFreq_Value=43227272.72727273
RCC.PLLI2SQ=8
RCC.PLLI2SQCLKFreq_Value=43227272.72727273
RCC.PLLI2SQoutputFreq_Value=43227272.72727273
RCC.PLLI2SR=7
RCC.PLLI2SRCLKFreq_Value=49402597.402597405
RCC.PLLI2SoutputFreq_Value=43227272.72727273
RCC.PLLM=8
RCC.PLLN=160
RCC.PLLQ=5
RCC.PLLQCLKFreq_Value=48000000
RCC.PLLQoutputFreq_Value=48000000
RCC.PLLR=5
RCC.PLLRCLKFreq_Value=48000000
RCC.PLLRoutputFreq_Value=48000000
RCC.PWRFreq_Value=120000000
RCC.RCC_RTC_Clock_Source=RCC_RTCCLKSOURCE_LSE
RCC.RCC_RTC_Clock_SourceVirtual=RCC_RTCCLKSOURCE_LSE
RCC.RCC_TIM_PRescaler_Selection=RCC_TIMPRES_DESACTIVATED
RCC.RNGFreq_Value=48000000
RCC.RTCFreq_Value=32768
RCC.SDIOFreq_Value=48000000
RCC.SYSCLKFreq_VALUE=120000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
RCC.USBFreq_Value=48000000
RCC.VCOI2SInputFreq_Value=1090909.0909090908
RCC.VCOI2SOutputFreq_Value=345818181.8181818
RCC.VCOInputFreq_Value=1500000
RCC.VCOOutputFreq_Value=240000000
SDIO.ClockBypass=SDIO_CLOCK_BYPASS_DISABLE
SDIO.ClockDiv=2
SDIO.ClockPowerSave=SDIO_CLOCK_POWER_SAVE_DISABLE
SDIO.HardwareFlowControl=SDIO_HARDWARE_FLOW_CONTROL_ENABLE
SDIO.IPParameters=ClockBypass,ClockDiv,HardwareFlowControl,ClockPowerSave
SH.ADCx_IN0.0=ADC1_IN0,IN0
SH.ADCx_IN0.ConfNb=1
SH.GPXTI1.0=GPIO_EXTI1
SH.GPXTI1.ConfNb=1
SH.GPXTI10.0=GPIO_EXTI10
SH.GPXTI10.ConfNb=1
SH.GPXTI11.0=GPIO_EXTI11
SH.GPXTI11.ConfNb=1
SH.GPXTI2.0=GPIO_EXTI2
SH.GPXTI2.ConfNb=1
SH.GPXTI3.0=GPIO_EXTI3
SH.GPXTI3.ConfNb=1
SH.GPXTI9.0=GPIO_EXTI9
SH.GPXTI9.ConfNb=1
STMicroelectronics.X-CUBE-AI.5.1.2.ActivationBufferSizeList=21352
STMicroelectronics.X-CUBE-AI.5.1.2.ArtificialOoIntelligenceJjXAaCUBEAaAI_Checked=true
STMicroelectronics.X-CUBE-AI.5.1.2.HeapSize=0x10000
STMicroelectronics.X-CUBE-AI.5.1.2.IPParameters=XAaCUBEAaAICcArtificialOoIntelligenceJjCore,HeapSize,StackSize,ModelName-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelType-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelKind-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelHashList,ModelNameList,WorkingBufferStartAddrList,LatestDirectoryUsed-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelFlashOccupation-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelRamOccupation-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelMacc-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelActualCompression-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ModelCompression-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,InternalRamActivationBufferMaxSize,ActivationBufferSizeList,MaximumNumberOfInputLayer,MaximumNumberOfOutputLayer,MaximumSizeOfInputLayer,MaximumSizeOfOutputLayer,ModelStructureFile-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ValidationInputFileHistory-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4,ValidationOutputFileHistory-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4
STMicroelectronics.X-CUBE-AI.5.1.2.InternalRamActivationBufferMaxSize=AI_VOICECOMMANDSNN_DATA_ACTIVATIONS_SIZE
STMicroelectronics.X-CUBE-AI.5.1.2.LatestDirectoryUsed-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=D\:\\Projects\\NN_Ledokol
STMicroelectronics.X-CUBE-AI.5.1.2.MaximumNumberOfInputLayer=1
STMicroelectronics.X-CUBE-AI.5.1.2.MaximumNumberOfOutputLayer=1
STMicroelectronics.X-CUBE-AI.5.1.2.MaximumSizeOfInputLayer=AI_VOICECOMMANDSNN_IN_1_SIZE_BYTES
STMicroelectronics.X-CUBE-AI.5.1.2.MaximumSizeOfOutputLayer=AI_VOICECOMMANDSNN_OUT_1_SIZE_BYTES
STMicroelectronics.X-CUBE-AI.5.1.2.ModelActualCompression-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=0.0
STMicroelectronics.X-CUBE-AI.5.1.2.ModelCompression-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=1
STMicroelectronics.X-CUBE-AI.5.1.2.ModelFlashOccupation-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=45420
STMicroelectronics.X-CUBE-AI.5.1.2.ModelHashList=7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4
STMicroelectronics.X-CUBE-AI.5.1.2.ModelKind-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=KERAS
STMicroelectronics.X-CUBE-AI.5.1.2.ModelMacc-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=406205
STMicroelectronics.X-CUBE-AI.5.1.2.ModelName-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=voicecommandsnn
STMicroelectronics.X-CUBE-AI.5.1.2.ModelNameList=voicecommandsnn
STMicroelectronics.X-CUBE-AI.5.1.2.ModelRamOccupation-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=21352
STMicroelectronics.X-CUBE-AI.5.1.2.ModelStructureFile-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=D\:\\Projects\\NN_Ledokol\\model.h5
STMicroelectronics.X-CUBE-AI.5.1.2.ModelType-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=Saved model
STMicroelectronics.X-CUBE-AI.5.1.2.StackSize=0x4000
STMicroelectronics.X-CUBE-AI.5.1.2.ValidationInputFileHistory-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=
STMicroelectronics.X-CUBE-AI.5.1.2.ValidationOutputFileHistory-7eaf034a37b35a45d6d7cf12b8d3d31f6f34ced2ad5d0e77518c34e53d65cea4=
STMicroelectronics.X-CUBE-AI.5.1.2.WorkingBufferStartAddrList=0xFFFFFFFF
STMicroelectronics.X-CUBE-AI.5.1.2.XAaCUBEAaAICcArtificialOoIntelligenceJjCore=true
STMicroelectronics.X-CUBE-AI.5.1.2_SwParameter=XAaCUBEAaAICcArtificialOoIntelligenceJjCore\:true;
TIM1.AutoReloadPreload=TIM_AUTORELOAD_PRELOAD_DISABLE
TIM1.BreakState=TIM_BREAK_DISABLE
TIM1.Channel-PWM\ Generation1\ No\ Output=TIM_CHANNEL_1
TIM1.Channel-PWM\ Generation2\ No\ Output=TIM_CHANNEL_2
TIM1.Channel-PWM\ Generation3\ No\ Output=TIM_CHANNEL_3
TIM1.Channel-PWM\ Generation4\ No\ Output=TIM_CHANNEL_4
TIM1.ClockDivision=TIM_CLOCKDIVISION_DIV1
TIM1.CounterMode=TIM_COUNTERMODE_DOWN
TIM1.IPParameters=Channel-PWM Generation3 No Output,Channel-PWM Generation1 No Output,Period,Prescaler,Pulse-PWM Generation3 No Output,CounterMode,ClockDivision,BreakState,OC1Preload_PWM,OC3Preload_PWM,OCPolarity_3,OCMode_PWM-PWM Generation3 No Output,OCMode_PWM-PWM Generation1 No Output,AutoReloadPreload,TIM_MasterOutputTrigger,TIM_MasterSlaveMode,OCFastMode_PWM-PWM Generation3 No Output,OCPolarity_1,OCIdleState_1,OCIdleState_3,Channel-PWM Generation2 No Output,Channel-PWM Generation4 No Output,OCMode_PWM-PWM Generation2 No Output,OCMode_PWM-PWM Generation4 No Output,Pulse-PWM Generation4 No Output,Pulse-PWM Generation1 No Output,Pulse-PWM Generation2 No Output,OC2Preload_PWM,OC4Preload_PWM,OCFastMode_PWM-PWM Generation4 No Output,OCFastMode_PWM-PWM Generation1 No Output,OCFastMode_PWM-PWM Generation2 No Output
TIM1.OC1Preload_PWM=ENABLE
TIM1.OC2Preload_PWM=ENABLE
TIM1.OC3Preload_PWM=ENABLE
TIM1.OC4Preload_PWM=ENABLE
TIM1.OCFastMode_PWM-PWM\ Generation1\ No\ Output=TIM_OCFAST_ENABLE
TIM1.OCFastMode_PWM-PWM\ Generation2\ No\ Output=TIM_OCFAST_ENABLE
TIM1.OCFastMode_PWM-PWM\ Generation3\ No\ Output=TIM_OCFAST_ENABLE
TIM1.OCFastMode_PWM-PWM\ Generation4\ No\ Output=TIM_OCFAST_ENABLE
TIM1.OCIdleState_1=TIM_OCIDLESTATE_RESET
TIM1.OCIdleState_3=TIM_OCIDLESTATE_RESET
TIM1.OCMode_PWM-PWM\ Generation1\ No\ Output=TIM_OCMODE_PWM1
TIM1.OCMode_PWM-PWM\ Generation2\ No\ Output=TIM_OCMODE_PWM1
TIM1.OCMode_PWM-PWM\ Generation3\ No\ Output=TIM_OCMODE_PWM1
TIM1.OCMode_PWM-PWM\ Generation4\ No\ Output=TIM_OCMODE_PWM1
TIM1.OCPolarity_1=TIM_OCPOLARITY_HIGH
TIM1.OCPolarity_3=TIM_OCPOLARITY_HIGH
TIM1.Period=9999
TIM1.Prescaler=0
TIM1.Pulse-PWM\ Generation1\ No\ Output=9980
TIM1.Pulse-PWM\ Generation2\ No\ Output=9980
TIM1.Pulse-PWM\ Generation3\ No\ Output=3000
TIM1.Pulse-PWM\ Generation4\ No\ Output=5000
TIM1.TIM_MasterOutputTrigger=TIM_TRGO_RESET
TIM1.TIM_MasterSlaveMode=TIM_MASTERSLAVEMODE_DISABLE
TIM10.IPParameters=Period
TIM10.Period=1
TIM11.IPParameters=Period
TIM11.Period=1
TIM12.IPParameters=Period
TIM12.Period=1
TIM3.IPParameters=Prescaler,Period,TIM_MasterOutputTrigger
TIM3.Period=1
TIM3.Prescaler=3749
TIM3.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
TIM4.IPParameters=Period,TIM_MasterSlaveMode,TIM_MasterOutputTrigger
TIM4.Period=3
TIM4.TIM_MasterOutputTrigger=TIM_TRGO_UPDATE
TIM4.TIM_MasterSlaveMode=TIM_MASTERSLAVEMODE_DISABLE
TIM5.ClockDivision=TIM_CLOCKDIVISION_DIV1
TIM5.CounterMode=TIM_COUNTERMODE_UP
TIM5.IPParameters=ClockDivision,Prescaler,Period,CounterMode
TIM5.Period=0xffffffff
TIM5.Prescaler=29999
USB_OTG_FS.IPParameters=VirtualMode
USB_OTG_FS.VirtualMode=Device_Only
VP_CRC_VS_CRC.Mode=CRC_Activate
VP_CRC_VS_CRC.Signal=CRC_VS_CRC
VP_FATFS_VS_SDIO.Mode=SDIO
VP_FATFS_VS_SDIO.Signal=FATFS_VS_SDIO
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.1.2.Mode=ArtificialOoIntelligenceJjXAaCUBEAaAI
VP_STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.1.2.Signal=STMicroelectronics.X-CUBE-AI_VS_ArtificialOoIntelligenceJjXAaCUBEAaAI_5.1.2
VP_SYS_VS_Systick.Mode=SysTick
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
VP_TIM10_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM10_VS_ClockSourceINT.Signal=TIM10_VS_ClockSourceINT
VP_TIM10_VS_OPM.Mode=OPM_bit
VP_TIM10_VS_OPM.Signal=TIM10_VS_OPM
VP_TIM11_VS_ClockSourceINT.Mode=Enable_Timer
VP_TIM11_VS_ClockSourceINT.Signal=TIM11_VS_ClockSourceINT
VP_TIM11_VS_OPM.Mode=OPM_bit
VP_TIM11_VS_OPM.Signal=TIM11_VS_OPM
VP_TIM12_VS_ClockSourceINT.Mode=Internal
VP_TIM12_VS_ClockSourceINT.Signal=TIM12_VS_ClockSourceINT
VP_TIM12_VS_OPM.Mode=OPM_bit
VP_TIM12_VS_OPM.Signal=TIM12_VS_OPM
VP_TIM1_VS_ClockSourceINT.Mode=Internal
VP_TIM1_VS_ClockSourceINT.Signal=TIM1_VS_ClockSourceINT
VP_TIM1_VS_ClockSourceITR.Mode=TriggerSource_ITR0
VP_TIM1_VS_ClockSourceITR.Signal=TIM1_VS_ClockSourceITR
VP_TIM1_VS_no_output1.Mode=PWM Generation1 No Output
VP_TIM1_VS_no_output1.Signal=TIM1_VS_no_output1
VP_TIM1_VS_no_output2.Mode=PWM Generation2 No Output
VP_TIM1_VS_no_output2.Signal=TIM1_VS_no_output2
VP_TIM1_VS_no_output3.Mode=PWM Generation3 No Output
VP_TIM1_VS_no_output3.Signal=TIM1_VS_no_output3
VP_TIM1_VS_no_output4.Mode=PWM Generation4 No Output
VP_TIM1_VS_no_output4.Signal=TIM1_VS_no_output4
VP_TIM3_VS_ClockSourceINT.Mode=Internal
VP_TIM3_VS_ClockSourceINT.Signal=TIM3_VS_ClockSourceINT
VP_TIM4_VS_ClockSourceINT.Mode=Internal
VP_TIM4_VS_ClockSourceINT.Signal=TIM4_VS_ClockSourceINT
VP_TIM4_VS_ClockSourceITR.Mode=TriggerSource_ITR2
VP_TIM4_VS_ClockSourceITR.Signal=TIM4_VS_ClockSourceITR
VP_TIM5_VS_ClockSourceITR.Mode=TriggerSource_ITR2
VP_TIM5_VS_ClockSourceITR.Signal=TIM5_VS_ClockSourceITR
VP_TIM5_VS_ControllerModeClock.Mode=Clock Mode
VP_TIM5_VS_ControllerModeClock.Signal=TIM5_VS_ControllerModeClock
board=custom
isbadioc=false
